src/Documents/Разукомплектовка/Разукомплектовка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Разукомплектовка</name>
  <basedOn>Document.ПроизводственноеЗадание</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНеисправности</name>
    <type>
      <types>CatalogRef.ВидыНеисправностей</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйКомментарий</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/СтендовыйПрогон/СтендовыйПрогон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтендовыйПрогон</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Прогон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПоступление</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительПостановка</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПостановки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсполнительСнятие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСнятия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Стенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поступление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Разукомплектовка/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
МестаХранения = РегистрыНакопления.МестаХранения;
// регистр МестаХранения Расход
Движения.МестаХранения.Записывать = Истина;
ВиртуальнаяТабличнаяЧасть = ТабличнаяЧасть.Выгрузить();
ВиртуальнаяТабличнаяЧасть.Свернуть("МПЗ,ЕдиницаИзмерения","Количество");
	Для Каждого ТЧ Из ВиртуальнаяТабличнаяЧасть Цикл
	Фильтр   = Новый Структура;
	Фильтр.Вставить("МестоХранения",Линейка.МестоХраненияКанбанов);
	Фильтр.Вставить("МПЗ", ТЧ.МПЗ);
	Остаток = МестаХранения.Остатки(Дата,Фильтр,"МПЗ", "Количество");
	БазовоеКоличество = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
		Если Остаток.Количество() > 0 Тогда
			Если Остаток[0].Количество < БазовоеКоличество Тогда
			Отказ = Истина;
			Сообщить("МПЗ "+ТЧ.МПЗ+" требуется списать: "+БазовоеКоличество+" наличествует на складе: "+Остаток[0].Количество);
			Продолжить;
			КонецЕсли; 		
		Иначе	
		Отказ = Истина;
		Сообщить("МПЗ "+ТЧ.МПЗ+" требуется списать: "+БазовоеКоличество+" наличествует на складе: 0");		
		КонецЕсли; 
	Движение = Движения.МестаХранения.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.МестоХранения = Линейка.МестоХраненияКанбанов;
		Если ТипЗнч(ТЧ.МПЗ) = Тип("СправочникСсылка.Материалы") Тогда
		Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
		Иначе	
		Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
		КонецЕсли; 
	Движение.МПЗ = ТЧ.МПЗ;
	Движение.Количество = БазовоеКоличество;
	КонецЦикла;
//Откат этапов производственного задания до заданного рабочего места
ЭПЗ = РегистрыСведений.ЭтапыПроизводственныхЗаданий.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("ПЗ",ДокументОснование));
	Если ЭПЗ.Ремонт Тогда
	флНайдено = Ложь;
	Выборка = РегистрыСведений.ЭтапыПроизводственныхЗаданий.Выбрать(,,Новый Структура("ПЗ",ДокументОснование));
		Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = Выборка.ПолучитьМенеджерЗаписи();
		МенеджерЗаписи.Прочитать();
		ПрефиксРМ = СокрЛП(МенеджерЗаписи.РабочееМесто.ГруппаРабочихМест.Префикс);
	   		Если МенеджерЗаписи.РабочееМесто = РабочееМесто Тогда
			флНайдено = Истина;
				Если СокрЛП(ПрефиксРМ) = "СТ" Тогда
				СуществующийСП = РегистрыСведений.СтендовыйПрогон.ПолучитьПоследнее(,Новый Структура("ПЗ",ДокументОснование));
				СП = РегистрыСведений.СтендовыйПрогон.СоздатьМенеджерЗаписи();
				СП.Период = ТекущаяДата();
				СП.ПЗ = ДокументОснование;
				СП.Изделие = ДокументОснование.Изделие;
				СП.БарКод = ДокументОснование.БарКод;
				СП.Стенд = РабочееМесто.Стенд;
				СП.Прогон = СуществующийСП.Прогон+1;
				СП.ИсполнительПоступление = РабочееМесто.Стенд.Исполнитель;
				СП.ДатаПоступления = ТекущаяДата();
				СП.ИсполнительПостановка = РабочееМесто.Стенд.Исполнитель;
				СП.ДатаПостановки = ТекущаяДата();
				СП.Записать();
				МенеджерЗаписи.ДатаОкончания = Дата(1,1,1);
				МенеджерЗаписи.Ремонт = Ложь;
				МенеджерЗаписи.Записать();
				Иначе
				МенеджерЗаписи.Исполнитель = Справочники.Сотрудники.ПустаяСсылка();
				МенеджерЗаписи.ДатаНачала = Дата(1,1,1);
				МенеджерЗаписи.ДатаОкончания = Дата(1,1,1);
				МенеджерЗаписи.Ремонт = Ложь;	
				МенеджерЗаписи.Записать();
				КонецЕсли; 
			Выпуск = Документы.ВыпускПродукции.НайтиПоНомеру(СокрЛП(ДокументОснование.Номер)+"-"+ПрефиксРМ,Дата);
				Если Не Выпуск.Пустая() Тогда
				ДокВыпуск = Выпуск.ПолучитьОбъект();					
				ДокВыпуск.Удалить();
				Иначе
				Выпуск = Документы.ВыпускПродукции.НайтиПоНомеру(СокрЛП(ДокументОснование.Номер)+"-"+ПрефиксРМ,НачалоГода(ТекущаяДата())-1);
					Если Не Выпуск.Пустая() Тогда
					ДокВыпуск = Выпуск.ПолучитьОбъект();					
					ДокВыпуск.Удалить();
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если флНайдено Тогда
				Выпуск = Документы.ВыпускПродукции.НайтиПоНомеру(СокрЛП(ДокументОснование.Номер)+"-"+ПрефиксРМ,Дата);
					Если Не Выпуск.Пустая() Тогда
					ДокВыпуск = Выпуск.ПолучитьОбъект();					
					ДокВыпуск.Удалить();
					Иначе
					Выпуск = Документы.ВыпускПродукции.НайтиПоНомеру(СокрЛП(ДокументОснование.Номер)+"-"+ПрефиксРМ,НачалоГода(ТекущаяДата())-1);
						Если Не Выпуск.Пустая() Тогда
						ДокВыпуск = Выпуск.ПолучитьОбъект();					
						ДокВыпуск.Удалить();
						КонецЕсли;
					КонецЕсли; 
				МенеджерЗаписи.Удалить();	
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры
